{
  "version": 1,
  "projects": [
    {
      "id": "gitseek",
      "title": "GitSeek",
      "description": "AI-powered code extraction tool that intelligently analyzes GitHub repositories and extracts relevant code snippets.",
      "detailedDescription": "## Project Overview\n\nGitSeek is an AI-based code extraction tool designed to solve the code location challenges developers face when learning open source projects. Traditional methods require manually browsing large code repositories to find specific feature implementations, which is inefficient and prone to missing critical details.\n\nThrough natural language processing technology, GitSeek allows users to find relevant code files using simple text descriptions. The system automatically extracts complete code snippets that can be directly used for AI tool analysis or as development references.\n\n## Technical Architecture\n\nThe backend is built on Python FastAPI framework, accessing repository data through GitHub API. Core algorithms handle project structure parsing, code dependency analysis, and semantic similarity matching for user queries. The frontend uses TypeScript and React tech stack, providing clean user interface and intuitive interaction experience.\n\nThe system implements temporary access policies to protect user privacy, with all GitHub tokens and downloaded code automatically cleaned up after analysis completion. The project also integrates architecture visualization modules, capable of automatically generating directory trees and architecture diagrams to help users understand overall project structure.\n\n## Application Value\n\nGitSeek effectively solves efficiency problems in the code learning process. Through precise code location and high-quality content extraction, this tool significantly improves developer learning efficiency while providing more accurate contextual input for AI-assisted development tools.",
      "technologies": ["TypeScript", "Python"],
      "image": "/assets/projects/gitseek.png",
      "screenshot": "/assets/projects/screenshots/gitseek-screenshot.png",
      "liveUrl": "https://gitseek.dev/",
      "featured": true,
      "category": "ai-agent"
    },
    {
      "id": "excel-whisper",
      "title": "Excel Whisper",
      "description": "Privacy-secure Excel AI analysis tool that processes data locally and supports natural language queries.",
      "detailedDescription": "## Project Overview\n\nExcel Whisper is a privacy-focused Excel analysis tool designed to solve efficiency and security issues in spreadsheet data analysis. Traditional data analysis tools require uploading sensitive data to cloud servers, posing privacy leak risks, while complex Excel formulas and functions increase user learning costs.\n\nExcel Whisper ensures all data analysis processes occur locally on user devices through browser-side processing technology, with data never leaving the user's browser. The system supports natural language queries, allowing users to perform complex data analysis operations with simple text descriptions, without needing to master complex Excel function syntax.\n\n## Technical Architecture\n\nThe system is built on modern web technologies, using TypeScript to ensure code quality and type safety. The frontend uses React framework, providing intuitive drag-and-drop interface and real-time analysis result display. The core processing engine runs in the browser, achieving high-performance data computation and processing through WebAssembly technology.\n\nThe data analysis module integrates natural language processing algorithms that can understand user query intent and convert it to corresponding data operations. The system supports simultaneous multi-file analysis, intelligent data cleaning, automatic chart generation, while maintaining strict localized processing principles to ensure data security.\n\n## Application Value\n\nExcel Whisper provides professional users with secure and efficient data analysis solutions. Through localized processing and natural language interface, this tool significantly lowers the technical threshold for data analysis while ensuring complete confidentiality of sensitive data. The system has been widely adopted by finance, consulting, research, and other industries with high data security requirements.",
      "technologies": ["TypeScript", "WebAssembly", "Python"],
      "image": "/assets/projects/excelwhisper.png",
      "screenshot": "/assets/projects/screenshots/excelwhisper-screenshot.png",
      "liveUrl": "https://excelwhisper.com/",
      "featured": true,
      "category": "ai-agent"
    },
    {
      "id": "richard-os",
      "title": "Richard OS",
      "description": "Web-based personalized showcase platform that integrates diverse application ecosystem to demonstrate personal abilities and characteristics.",
      "detailedDescription": "## Project Overview\n\nRichard OS is a personalized showcase platform based on the ryOS open source project modification. The system adopts desktop operating system interaction patterns, organizing personal showcase content as independent applications.\n\nVisitors can learn about personal technical abilities, project experience, interests, and creative content through operating system-like usage. The system integrates application modules including Projects, Hobbies, Gallery, Blog, and more.\n\n## Technical Architecture\n\nThe platform is built on React framework and TypeScript, using Vite as the build tool. The overall architecture adopts modular design, with each application developed as independent components.\n\nInterface design pays tribute to classic Mac OS aesthetics, creating retro visual experience through pixel-level UI restoration and Geneva font application. The system integrates window management mechanisms, supporting multi-window parallel operation, drag adjustment, and hierarchy management.",
      "technologies": ["TypeScript"],
      "image": "/assets/projects/richardos.png",
      "screenshot": "/assets/projects/screenshots/richardos-screenshot.png",
      "liveUrl": "https://os.richardwang.me",
      "githubUrl": "https://github.com/i-richardwang/RichardOS",
      "featured": true,
      "category": "web-app"
    },
    {
      "id": "sitesnapper",
      "title": "SiteSnapper",
      "description": "Website archiving tool that captures high-quality screenshots, metadata, and complete text content with one click.",
      "detailedDescription": "## Project Overview\n\nSiteSnapper is a comprehensive website archiving tool designed to solve webpage saving issues in content research and document management. Traditional bookmark and text saving methods cannot completely preserve the visual appearance and structural information of webpages, and when original webpages change or disappear, related information is lost.\n\nSiteSnapper can completely capture webpage visual screenshots, key metadata, and full text content within seconds through automated content extraction technology. The system supports multiple resolutions, device modes, and theme settings, ensuring captured content accurately reflects the original state of webpages.\n\n## Technical Architecture\n\nThe system uses headless browser technology for webpage rendering, supporting JavaScript execution and dynamic content loading. The backend is built on TypeScript and Node.js, using Puppeteer for page control and screenshot generation. The frontend adopts React tech stack, providing intuitive parameter configuration interface and real-time preview functionality.\n\nCore processing workflows include intelligent waiting mechanisms, element click simulation, and CSS injection functionality, ensuring captured content is complete and accurate. The system also integrates multiple output format support, allowing users to export screenshots in PNG or JPEG formats while providing structured metadata and text content.\n\n## Application Value\n\nSiteSnapper provides reliable solutions for digital content management. Through complete webpage archiving functionality, this tool helps researchers, content curators, and digital professionals build persistent content libraries. The system's efficient processing capabilities and 99.9% success rate make it an important tool for webpage content preservation and analysis.",
      "technologies": ["TypeScript"],
      "image": "/assets/projects/sitesnapper.png",
      "screenshot": "/assets/projects/screenshots/sitesnapper-screenshot.png",
      "liveUrl": "https://sitesnapper.app/",
      "featured": false,
      "category": "web-app"
    }
  ]
}